# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# 共四个版本  "shufflenetv2_05", "shufflenetv2_10", "shufflenetv2_15", "shufflenetv2_20"
# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, shufflenetv2_05, []] # 0-4 P1/2
#  - [-1, 1, shufflenetv2_10, []] # 0-4 P1/2
#  - [-1, 1, shufflenetv2_15, []] # 0-4 P1/2
#  - [-1, 1, shufflenetv2_20, []] # 0-4 P1/2
  - [-1, 1, SPPF, [1024, 5]] # 5
  - [-1, 2, C2PSA, [1024]] # 6

# YOLO11n head
head:
  - [-1, 1, Conv, [256, 1, 1]]  # 7, Y5, lateral_convs.0
  - [-1, 1, Dy_Sample, [2, "lp"]]  # lp nl 两种方法

  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 2, C3k2_LDConv2, [256, False]] # 11, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]  # 12, Y4, lateral_convs.1

  - [-1, 1, Dy_Sample, [2, "lp"]]  # lp nl 两种方法
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 14 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2_LDConv2, [256, False]]  # X3 (16), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]  # 17, downsample_convs.0
  - [[-1, 12], 1, Concat, [1]]  # cat Y4
  - [-1, 2, C3k2_LDConv2, [256, False]]  # F4 (19), pan_blocks.0

  - [-1, 1, SCDown, [256, 3, 2]]  # 20, downsample_convs.1
  - [[-1, 7], 1, Concat, [1]]  # cat Y5
  - [-1, 2, C3k2_LDConv2, [256, True]] # F5 (22), pan_blocks.1

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)
